# FabricationPartDoublewallMaterialArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPartDoublewallMaterialArea Property
ParameterTypeId Class See Also
---
"Double Wall Material Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPartDoublewallMaterialArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartDoublewallMaterialArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPartDoublewallMaterialArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace